{
  "topic": "Анонимные функции в Python",
  "introduction": "Анонимные функции, также известные как lambda-функции, являются одним из ключевых инструментов функционального программирования в Python. Они позволяют создавать простые функции без необходимости объявлять их с помощью ключевого слова def. Анонимные функции особенно полезны при работе с функциями высшего порядка, такими как map, filter, sorted.",
  "theory": {
    "overview": "Анонимные функции в Python создаются с помощью ключевого слова lambda. Они могут содержать только одно выражение и возвращают результат этого выражения. Lambda-функции могут использоваться везде, где требуется обычная функция, но их применение наиболее эффективно в комбинации с функциями высшего порядка.",
    "best_practices": [
      "Используйте lambda-функции, когда требуется короткая и простая функция",
      "Помните, что lambda-функции не могут содержать сложные инструкции или блоки кода",
      "Используйте lambda-функции вместе с функциями высшего порядка для упрощения кода"
    ],
    "common_mistakes": [
      "Избегайте создания слишком сложных lambda-функций, лучше использовать обычные функции в таких случаях",
      "Не злоупотребляйте lambda-функциями, они должны быть использованы там, где это имеет смысл"
    ]
  },
  "examples": [
    {
      "title": "Пример 1: Использование lambda с функцией map",
      "description": "Применение lambda-функции для умножения каждого элемента списка на 2 с помощью функции map.",
      "code": "numbers = [1, 2, 3, 4, 5]\ndoubled_numbers = list(map(lambda x: x * 2, numbers))",
      "explanation": "В данном примере создается lambda-функция, которая умножает каждый элемент списка на 2. Функция map применяет данную lambda-функцию ко всем элементам списка numbers, возвращая новый список doubled_numbers с удвоенными значениями."
    },
    {
      "title": "Пример 2: Использование lambda с функцией filter",
      "description": "Фильтрация списка чисел, оставляя только четные числа с использованием lambda и функции filter.",
      "code": "numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]\neven_numbers = list(filter(lambda x: x % 2 == 0, numbers))",
      "explanation": "В данном примере lambda-функция используется для проверки четности числа (остаток от деления на 2 равен 0). Функция filter применяет данную lambda-функцию к каждому элементу списка numbers и оставляет только те числа, для которых lambda-функция возвращает True."
    }
  ],
  "practice_examples": {
    "examples": [
      {
        "code": "numbers = [1, 2, 3, 4, 5]\nsum_of_squares = sum(map(lambda x: x**2, numbers))",
        "hidden_explanation": "В данном примере используется анонимная (lambda) функция для возведения каждого элемента списка в квадрат, затем результаты суммируются. Функция map применяет lambda-функцию к каждому элементу списка numbers.",
        "expected_concepts": [
          "Анонимные функции",
          "lambda-функция",
          "функция map",
          "функциональное программирование"
        ],
        "id": "анонимные_функции_в_python_ex1"
      },
      {
        "code": "names = ['Alice', 'Bob', 'Charlie', 'David']\nfiltered_names = list(filter(lambda name: name.startswith('A'), names))",
        "hidden_explanation": "В данном примере используется lambda-функция для фильтрации имен, оставляя только те, которые начинаются с буквы 'A'. Функция filter проверяет каждое имя в списке names с помощью lambda-функции.",
        "expected_concepts": [
          "Анонимные функции",
          "lambda-функция",
          "функция filter",
          "функциональное программирование"
        ],
        "id": "анонимные_функции_в_python_ex2"
      },
      {
        "code": "points = [(1, 2), (3, 4), (5, 6)]\nsorted_points = sorted(points, key=lambda x: x[1])",
        "hidden_explanation": "В данном примере используется lambda-функция для сортировки точек по их вторым координатам. Функция sorted принимает ключ с lambda-функцией для определения сортировки.",
        "expected_concepts": [
          "Анонимные функции",
          "lambda-функция",
          "функция sorted",
          "функциональное программирование"
        ],
        "id": "анонимные_функции_в_python_ex3"
      },
      {
        "code": "values = [10, 20, 30, 40, 50]\ndivisible_by_10 = list(filter(lambda x: x % 10 == 0, values))",
        "hidden_explanation": "В данном примере используется lambda-функция для фильтрации значений списка, оставляя только те, которые делятся на 10 без остатка. Функция filter проверяет каждое значение в списке values с помощью lambda-функции.",
        "expected_concepts": [
          "Анонимные функции",
          "lambda-функция",
          "функция filter",
          "функциональное программирование"
        ],
        "id": "анонимные_функции_в_python_ex4"
      },
      {
        "code": "words = ['apple', 'banana', 'cherry']\nreversed_words = list(map(lambda x: x[::-1], words))",
        "hidden_explanation": "В данном примере используется lambda-функция для обращения каждого слова в списке. Функция map применяет lambda-функцию к каждому слову в списке words, возвращая список с обращенными словами.",
        "expected_concepts": [
          "Анонимные функции",
          "lambda-функция",
          "функция map",
          "функциональное программирование"
        ],
        "id": "анонимные_функции_в_python_ex5"
      }
    ]
  }
}