{
  "topic": "Область видимости переменных в Python",
  "introduction": "Область видимости переменных - это концепция, определяющая доступность переменной в определенных участках кода. В Python существуют локальная, глобальная и нелокальная области видимости переменных, которые влияют на то, как переменные могут быть использованы в функциях. Понимание областей видимости поможет избежать ошибок и улучшить структуру кода.",
  "theory": {
    "overview": "Локальная область видимости переменных ограничена определением функции, в которой они были созданы. Глобальная область видимости включает переменные, определенные вне любой функции. Нелокальная область видимости позволяет функции использовать переменные из области видимости родительской функции. Ключевые слова global и nonlocal используются для изменения области видимости переменных.",
    "best_practices": [
      "Избегайте излишнего использования глобальных переменных, поскольку это может привести к сложностям в отслеживании и понимании кода.",
      "Используйте ключевые слова global и nonlocal осторожно, чтобы избежать неожиданного поведения программы из-за изменения области видимости переменных.",
      "Стремитесь к созданию функций с четкой локальной областью видимости переменных, чтобы улучшить читаемость и поддерживаемость кода."
    ],
    "common_mistakes": [
      "Неправильное использование ключевых слов global и nonlocal может привести к ошибкам, связанным с изменением значений переменных из неправильной области видимости.",
      "Недостаточное понимание областей видимости переменных может привести к неожиданным результатам работы программы.",
      "Избегайте создания глобальных переменных с одинаковыми именами, что может вызвать конфликты в области видимости."
    ]
  },
  "examples": [
    {
      "title": "Пример использования локальной области видимости",
      "description": "Пример функции, в которой создается локальная переменная.",
      "code": "def my_function():\n    x = 10\n    print(x)\n\nmy_function()",
      "explanation": "В данном примере переменная x создается внутри функции my_function и доступна только внутри этой функции. При вызове функции значение переменной x выводится на экран."
    },
    {
      "title": "Пример использования глобальной области видимости",
      "description": "Пример использования глобальной переменной в функции.",
      "code": "x = 10\n\ndef my_function():\n    print(x)\n\nmy_function()",
      "explanation": "Переменная x определена вне функции и доступна внутри функции my_function благодаря глобальной области видимости. При вызове функции значение переменной x выводится на экран."
    },
    {
      "title": "Пример использования ключевого слова global",
      "description": "Пример изменения значения глобальной переменной в функции.",
      "code": "x = 10\n\ndef my_function():\n    global x\n    x = 20\n    print(x)\n\nmy_function()\nprint(x)",
      "explanation": "В данном примере с помощью ключевого слова global переменная x объявляется как глобальная внутри функции my_function. После изменения значения переменной x в функции, оно сохраняется и доступно за пределами функции."
    },
    {
      "title": "Пример использования ключевого слова nonlocal",
      "description": "Пример доступа к переменной из родительской функции.",
      "code": "def outer_function():\n    x = 10\n    \n    def inner_function():\n        nonlocal x\n        x = 20\n        print(x)\n    \n    inner_function()\n    print(x)\n\nouter_function()",
      "explanation": "В данном примере функция inner_function имеет доступ к переменной x из родительской функции благодаря ключевому слову nonlocal. После изменения значения x во внутренней функции, оно также изменяется и доступно во внешней функции."
    }
  ],
  "practice_examples": {
    "examples": [
      {
        "code": "def local_scope_example():\n    x = 10\n    print(x)",
        "hidden_explanation": "Этот пример демонстрирует использование локальной области видимости переменных в Python.",
        "expected_concepts": [
          "Локальная область видимости",
          "Переменные внутри функции",
          "Ограничение доступа к переменным"
        ],
        "id": "область_видимости_переменных_в_python_ex1"
      },
      {
        "code": "global_variable = 10\n\ndef global_scope_example():\n    print(global_variable)",
        "hidden_explanation": "Этот пример показывает использование глобальной области видимости переменных для доступа к переменной, определенной вне функции.",
        "expected_concepts": [
          "Глобальная область видимости",
          "Переменные вне функции",
          "Доступ к глобальным переменным"
        ],
        "id": "область_видимости_переменных_в_python_ex2"
      },
      {
        "code": "global_var = 10\n\ndef modify_global():\n    global global_var\n    global_var = 20\n    print(global_var)\n\nmodify_global()\nprint(global_var)",
        "hidden_explanation": "В данном примере используется ключевое слово global для изменения значения глобальной переменной внутри функции.",
        "expected_concepts": [
          "Ключевое слово global",
          "Изменение глобальных переменных",
          "Обновление значений переменных"
        ],
        "id": "область_видимости_переменных_в_python_ex3"
      },
      {
        "code": "def outer_function():\n    x = 10\n    \n    def inner_function():\n        nonlocal x\n        x = 20\n        print(x)\n    \n    inner_function()\n    print(x)\n\nouter_function()",
        "hidden_explanation": "Этот пример демонстрирует использование ключевого слова nonlocal для доступа к переменной из родительской функции.",
        "expected_concepts": [
          "Ключевое слово nonlocal",
          "Доступ к переменным из родительской функции",
          "Изменение значений переменных"
        ],
        "id": "область_видимости_переменных_в_python_ex4"
      }
    ]
  }
}