{
  "topic": "Обработка исключений в Python",
  "introduction": "Обработка исключений является важной частью программирования, позволяющей предотвратить аварийное завершение программы при возникновении ошибок. В Python для этого используются блоки try, except, else и finally. Понимание иерархии исключений и умение создавать собственные исключения также являются важными навыками для разработчика.",
  "theory": {
    "overview": "Обработка исключений в Python позволяет программистам контролировать потенциально проблемные участки кода и предотвращать краш приложения при возникновении ошибок. Блок try используется для отлова исключений, блок except - для их обработки, блок else - для выполнения кода, если исключения не возникло, а finally - для выполнения кода независимо от того, произошло исключение или нет.",
    "best_practices": [
      "Обрабатывайте только те исключения, которые вы знаете как обработать",
      "Используйте специфические типы исключений, чтобы точно определить, какую ошибку нужно обработать",
      "Не игнорируйте исключения, даже если вам кажется, что они не существенны"
    ],
    "common_mistakes": [
      "Использование пустых except без указания конкретного типа исключения",
      "Игнорирование ошибок исключений, что может привести к непредсказуемому поведению программы",
      "Не освобождение ресурсов в блоке finally"
    ]
  },
  "examples": [
    {
      "title": "Пример использования блоков try, except, else, finally",
      "description": "Пример кода, демонстрирующий использование всех блоков обработки исключений",
      "code": "try:\n    # Код, который может вызвать исключение\n    result = 10 / 0\nexcept ZeroDivisionError as e:\n    # Обработка конкретного типа исключения\n    print(f'Ошибка деления на ноль: {e}')\nelse:\n    # Код, который выполняется, если исключение не возникло\n    print('Деление прошло успешно')\nfinally:\n    # Код, который выполняется всегда, независимо от того, произошло исключение или нет\n    print('Завершение программы')",
      "explanation": "В данном примере блок try выполняет деление на ноль, что приводит к возникновению исключения ZeroDivisionError. Блок except перехватывает это исключение и выводит сообщение об ошибке. Блок else не выполняется, так как исключение произошло, но блок finally всегда выполнится, выводя сообщение о завершении программы."
    },
    {
      "title": "Пример создания собственного исключения",
      "description": "Пример кода, показывающий создание собственного класса исключения",
      "code": "class CustomError(Exception):\n    def __init__(self, message):\n        self.message = message\n\ntry:\n    raise CustomError('Собственное исключение')\nexcept CustomError as e:\n    print(f'Поймано собственное исключение: {e.message}')",
      "explanation": "В этом примере создается собственный класс исключения CustomError, который наследуется от базового класса Exception. Затем в блоке try возбуждается исключение CustomError с сообщением. Блок except перехватывает это исключение и выводит сообщение об ошибке."
    }
  ],
  "practice_examples": {
    "examples": [
      {
        "code": "try:\n    x = int('hello')\nexcept ValueError as e:\n    print(f'Ошибка преобразования типа: {e}')",
        "hidden_explanation": "Попытка преобразовать строку 'hello' в целое число вызывает исключение ValueError, которое затем перехватывается блоком except. Выводится сообщение об ошибке, содержащее информацию об исключении.",
        "expected_concepts": [
          "Блок try",
          "Обработка исключений",
          "Исключение ValueError"
        ],
        "id": "обработка_исключений_в_python_ex1"
      },
      {
        "code": "try:\n    file = open('non_existent_file.txt', 'r')\nexcept FileNotFoundError:\n    print('Файл не найден')",
        "hidden_explanation": "Попытка открыть несуществующий файл 'non_existent_file.txt' вызывает исключение FileNotFoundError, которое перехватывается блоком except. Выводится сообщение о том, что файл не найден.",
        "expected_concepts": [
          "Обработка исключений",
          "Исключение FileNotFoundError",
          "Работа с файлами"
        ],
        "id": "обработка_исключений_в_python_ex2"
      },
      {
        "code": "try:\n    result = 10 / 0\nexcept ZeroDivisionError as e:\n    print(f'Ошибка деления на ноль: {e}')",
        "hidden_explanation": "Попытка выполнить деление на ноль вызывает исключение ZeroDivisionError, которое перехватывается блоком except. Выводится сообщение об ошибке, содержащее информацию об исключении.",
        "expected_concepts": [
          "Исключение ZeroDivisionError",
          "Обработка исключений",
          "Деление на ноль"
        ],
        "id": "обработка_исключений_в_python_ex3"
      },
      {
        "code": "try:\n    numbers = [1, 2, 3]\n    print(numbers[5])\nexcept IndexError:\n    print('Индекс вне диапазона')",
        "hidden_explanation": "Попытка обратиться к элементу списка с индексом 5, когда список содержит только три элемента, вызывает исключение IndexError. Блок except перехватывает это исключение и выводит сообщение о том, что индекс находится вне диапазона.",
        "expected_concepts": [
          "Индексация списков",
          "Исключение IndexError",
          "Обработка исключений"
        ],
        "id": "обработка_исключений_в_python_ex4"
      },
      {
        "code": "try:\n    value = int(input('Введите число: '))\nexcept ValueError:\n    print('Некорректный ввод')",
        "hidden_explanation": "Попытка преобразовать введенное пользователем значение в целое число вызывает исключение ValueError, которое перехватывается блоком except. Выводится сообщение о некорректном вводе.",
        "expected_concepts": [
          "Преобразование типов",
          "Обработка исключений",
          "Исключение ValueError"
        ],
        "id": "обработка_исключений_в_python_ex5"
      }
    ]
  }
}